[NoCoverage] StringLiteral
src/tools/hello.ts:5:3
 import { z } from "zod/v4";
 
 export const helloTool = tool(
-  "hello",
+  "",
   "A test tool that greets the user by name. Use this when asked to greet someone.",
   { name: z.string().describe("The name to greet") },

[NoCoverage] StringLiteral
src/tools/hello.ts:7:31
 export const helloTool = tool(
   "hello",
   "A test tool that greets the user by name. Use this when asked to greet someone.",
-  { name: z.string().describe("The name to greet") },
+  { name: z.string().describe("") },
   async ({ name }) => ({
     content: [{ type: "text" as const, text: `Hello, ${name}! 🎉 The MCP Tool is working!` }],

[NoCoverage] ObjectLiteral
src/tools/hello.ts:8:24
   "hello",
   "A test tool that greets the user by name. Use this when asked to greet someone.",
   { name: z.string().describe("The name to greet") },
-  async ({ name }) => ({
-    content: [{ type: "text" as const, text: `Hello, ${name}! 🎉 The MCP Tool is working!` }],
-  })
+  async ({ name }) => ({})
 );
 
