[Survived] LogicalOperator
src/agent.ts:14:14
 //   "components"     — React components
 //   "pipeline"       — queryTransform, contextManager (needs mocks)
 //   "full"           — autonomous coverage-driven full run
-const mode = process.argv[2] || "pure-functions";
+const mode = process.argv[2] && "pure-functions";
 
 export const TARGET_MODULES: Record<string, { files: string; description: string }> = {

[Survived] StringLiteral
src/agent.ts:14:33
 //   "components"     — React components
 //   "pipeline"       — queryTransform, contextManager (needs mocks)
 //   "full"           — autonomous coverage-driven full run
-const mode = process.argv[2] || "pure-functions";
+const mode = process.argv[2] || "";
 
 export const TARGET_MODULES: Record<string, { files: string; description: string }> = {

[Killed] StringLiteral
src/agent.ts:19:18
 export const TARGET_MODULES: Record<string, { files: string; description: string }> = {
   "pure-functions": {
     files: "src/lib/search/bm25.ts, src/lib/search/tokenizer.ts, src/lib/search/fusion.ts",
-    description: "Pure function unit tests for search modules (BM25, tokenizer, fusion). No mocks needed — test inputs and outputs directly.",
+    description: "",
   },
   utils: {
killedBy: TARGET_MODULES should have files and description for every mode
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/agent.ts:23:18
   },
   utils: {
     files: "src/utils/markdownPreprocessor.ts, src/utils/astMarkdownProcessor.ts",
-    description: "Pure function unit tests for utility modules. No mocks needed.",
+    description: "",
   },
   components: {
killedBy: TARGET_MODULES should have files and description for every mode
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/agent.ts:27:18
   },
   components: {
-    description: "React component tests using RTL. Test rendering, user interactions, conditional rendering, and callback props.",
+    description: "",
   },
   pipeline: {
killedBy: TARGET_MODULES should have files and description for every mode
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/agent.ts:30:12
     description: "React component tests using RTL. Test rendering, user interactions, conditional rendering, and callback props.",
   },
   pipeline: {
-    files: "src/lib/pipeline/queryTransform.ts, src/lib/pipeline/contextManager.ts, src/lib/pipeline/reranker.ts",
+    files: "",
     description: "Pipeline logic tests. These modules call external APIs (LLM, embeddings) — mock all external dependencies, test the logic branches.",
   },
killedBy: TARGET_MODULES should have files and description for every mode
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/agent.ts:35:18
   },
   full: {
     files: "ALL",
-    description: "Autonomous coverage-driven run. Explore the project, identify all untested modules, generate tests prioritized by value, and iterate until coverage target (40%+) is met.",
+    description: "",
   },
 };
killedBy: TARGET_MODULES should have files and description for every mode
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/agent.ts:41:16
 
 export function buildPrompt(runMode: string): string {
   const target = TARGET_MODULES[runMode];
-  if (!target) {
-    console.error(`Unknown mode: ${runMode}. Available: ${Object.keys(TARGET_MODULES).join(", ")}`);
-    process.exit(1);
-  }
+  if (!target) {}
 
   if (runMode === "full") {
killedBy: buildPrompt should exit on unknown mode
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "process.exit(1)"
Received message:   "Cannot read properties of undefined (reading 'files')"

      123 |     return stryMutAct_9fa48("35") ? `` : (stryCov_9fa48("35"), `You are a Test Generation Agent. Your target project is at: ${TARGET_PROJECT}
      124 |
    > 125 | Generate tests for these specific files: ${target.files}

[Killed] ConditionalExpression
src/agent.ts:41:7
 
 export function buildPrompt(runMode: string): string {
   const target = TARGET_MODULES[runMode];
-  if (!target) {
+  if (false) {
     console.error(`Unknown mode: ${runMode}. Available: ${Object.keys(TARGET_MODULES).join(", ")}`);
     process.exit(1);
killedBy: buildPrompt should exit on unknown mode
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "process.exit(1)"
Received message:   "Cannot read properties of undefined (reading 'files')"

      123 |     return stryMutAct_9fa48("35") ? `` : (stryCov_9fa48("35"), `You are a Test Generation Agent. Your target project is at: ${TARGET_PROJECT}
      124 |
    > 125 | Generate tests for these specific files: ${target.files}

[Killed] ConditionalExpression
src/agent.ts:46:7
     process.exit(1);
   }
 
-  if (runMode === "full") {
+  if (false) {
     return `You are a Test Generation Agent. Your target project is at: ${TARGET_PROJECT}
 
killedBy: buildPrompt should generate a different prompt for full mode
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "EXPLORE"
Received string:    "You are a Test Generation Agent. Your target project is at: /Users/yangxiyue/2026/aa/confluence-qa-assistant·
Generate tests for these specific files: ALL·
Context: Autonomous coverage-driven run. Explore the project, identify all untested modules, generate tests prioritized by value, and ite

[Killed] BlockStatement
src/agent.ts:46:27
     process.exit(1);
   }
 
-  if (runMode === "full") {
-    return `You are a Test Generation Agent. Your target project is at: ${TARGET_PROJECT}
-
-Follow the EXPLORE → PLAN → EXECUTE → VERIFY loop from your CLAUDE.md rules.
-
-Your goal: achieve 40%+ statement coverage across the project.
-
-Steps:
-1. EXPLORE: Read package.json, jest.config.ts, tsconfig.json, and existing tests. Glob all source files.
-2. PLAN: List all untested modules, prioritize by value (pure functions first, then components, then pipeline logic with mocks).
-3. EXECUTE: For each module, read the source, write the test file, run it, fix if needed (max 3 attempts per file).
-4. VERIFY: Run full coverage with \`npx jest --coverage --coverageReporters=json-summary --watchAll=false\`, then use parse_coverage tool on ${TARGET_PROJECT}/coverage/coverage-summary.json.
-
-If coverage < 40%, identify uncovered files and generate more tests. Repeat until target is met or all feasible modules are tested.
-
-Output a final summary with: modules tested, pass/fail status, coverage before and after.`;
-  }
+  if (runMode === "full") {}
 
   return `You are a Test Generation Agent. Your target project is at: ${TARGET_PROJECT}
killedBy: buildPrompt should generate a different prompt for full mode
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "EXPLORE"
Received string:    "You are a Test Generation Agent. Your target project is at: /Users/yangxiyue/2026/aa/confluence-qa-assistant·
Generate tests for these specific files: ALL·
Context: Autonomous coverage-driven run. Explore the project, identify all untested modules, generate tests prioritized by value, and ite

[NoCoverage] OptionalChaining
src/agent.ts:88:29
   const safetyHook = createSafetyHook(TARGET_PROJECT);
 
   console.log(`\n🚀 Test Generation Agent — mode: ${mode}\n`);
-  console.log(`📁 Target: ${TARGET_MODULES[mode]?.files}\n`);
+  console.log(`📁 Target: ${TTARGET_MODULES[mode].files\n`);
   console.log("─".repeat(60) + "\n");
 

[NoCoverage] StringLiteral
src/agent.ts:97:17
       cwd: TARGET_PROJECT,
       permissionMode: "acceptEdits",
       allowedTools: [
-        "Read", "Write", "Edit", "Glob", "Grep", "Bash",
+        "Read", "", "Edit", "Glob", "Grep", "Bash",
         "mcp__coverage-parser__parse_coverage",
       ],

[NoCoverage] StringLiteral
src/agent.ts:97:34
       cwd: TARGET_PROJECT,
       permissionMode: "acceptEdits",
       allowedTools: [
-        "Read", "Write", "Edit", "Glob", "Grep", "Bash",
+        "Read", "Write", "Edit", "", "Grep", "Bash",
         "mcp__coverage-parser__parse_coverage",
       ],

[NoCoverage] BlockStatement
src/agent.ts:106:61
           {
             hooks: [
               async (input) => {
-                if (input.hook_event_name === "PreToolUse") {
-                  return await safetyHook(input);
-                }
+                if (input.hook_event_name === "PreToolUse") {}
                 return { decision: "approve" as const };
               },

[NoCoverage] StringLiteral
src/agent.ts:116:14
         ],
       },
       maxTurns: 200,
-      model: "claude-sonnet-4-6",
+      model: "",
     },
   });

[NoCoverage] BlockStatement
src/agent.ts:120:41
     },
   });
 
-  for await (const msg of conversation) {
-    if (msg.type === "assistant") {
-      for (const block of msg.message.content) {
-        if (block.type === "text") {
-          console.log(block.text);
-        }
-      }
-    }
-  }
+  for await (const msg of conversation) {}
 
   console.log("\n" + "─".repeat(60));

[NoCoverage] BlockStatement
src/agent.ts:121:35
   });
 
   for await (const msg of conversation) {
-    if (msg.type === "assistant") {
-      for (const block of msg.message.content) {
-        if (block.type === "text") {
-          console.log(block.text);
-        }
-      }
-    }
+    if (msg.type === "assistant") {}
   }
 

[NoCoverage] BlockStatement
src/agent.ts:122:48
 
   for await (const msg of conversation) {
     if (msg.type === "assistant") {
-      for (const block of msg.message.content) {
-        if (block.type === "text") {
-          console.log(block.text);
-        }
-      }
+      for (const block of msg.message.content) {}
     }
   }

[NoCoverage] ConditionalExpression
src/agent.ts:123:13
   for await (const msg of conversation) {
     if (msg.type === "assistant") {
       for (const block of msg.message.content) {
-        if (block.type === "text") {
+        if (true) {
           console.log(block.text);
         }

[NoCoverage] BlockStatement
src/agent.ts:123:36
   for await (const msg of conversation) {
     if (msg.type === "assistant") {
       for (const block of msg.message.content) {
-        if (block.type === "text") {
-          console.log(block.text);
-        }
+        if (block.type === "text") {}
       }
     }

[Survived] LogicalOperator
src/agent.ts:136:3
 
 // Only run when executed directly, not when imported for testing
 const isDirectRun =
-  process.argv[1]?.endsWith("agent.ts") ||
-  process.argv[1]?.endsWith("agent.js");
+  process.argv[1]?.endsWith("agent.ts") && process.argv[1]?.endsWith("agent.js");
 if (isDirectRun) {
   main().catch(console.error);

[Survived] ConditionalExpression
src/agent.ts:136:3
 
 // Only run when executed directly, not when imported for testing
 const isDirectRun =
-  process.argv[1]?.endsWith("agent.ts") ||
-  process.argv[1]?.endsWith("agent.js");
+  false;
 if (isDirectRun) {
   main().catch(console.error);

[Survived] MethodExpression
src/agent.ts:137:3
 // Only run when executed directly, not when imported for testing
 const isDirectRun =
   process.argv[1]?.endsWith("agent.ts") ||
-  process.argv[1]?.endsWith("agent.js");
+  process.argv[1]?.startsWith("agent.js");
 if (isDirectRun) {
   main().catch(console.error);

[Survived] OptionalChaining
src/agent.ts:137:3
 // Only run when executed directly, not when imported for testing
 const isDirectRun =
   process.argv[1]?.endsWith("agent.ts") ||
-  process.argv[1]?.endsWith("agent.js");
+  process.argv[1].endsWith("agent.js");
 if (isDirectRun) {
   main().catch(console.error);

[NoCoverage] BlockStatement
src/agent.ts:138:18
 const isDirectRun =
   process.argv[1]?.endsWith("agent.ts") ||
   process.argv[1]?.endsWith("agent.js");
-if (isDirectRun) {
-  main().catch(console.error);
-}
+if (isDirectRun) {}
 

[Survived] ConditionalExpression
src/agent.ts:138:5
 const isDirectRun =
   process.argv[1]?.endsWith("agent.ts") ||
   process.argv[1]?.endsWith("agent.js");
-if (isDirectRun) {
+if (true) {
   main().catch(console.error);
 }
