[Survived] Regex
src/hooks/safety.ts:11:3
 // Patterns that are allowed to be written/edited
 const ALLOWED_PATTERNS = [
   /\/__tests__\//,          // Test directories
-  /\.test\.[tj]sx?$/,       // Test files
+  /\.test\.[tj]sx?/,       // Test files
   /\.spec\.[tj]sx?$/,       // Spec files
   /jest\.config\.[tj]s$/,   // Jest config

[Killed] Regex
src/hooks/safety.ts:13:3
   /\/__tests__\//,          // Test directories
   /\.test\.[tj]sx?$/,       // Test files
   /\.spec\.[tj]sx?$/,       // Spec files
-  /jest\.config\.[tj]s$/,   // Jest config
+  /jest\.config\.[^tj]s$/,   // Jest config
   /jest\.setup\.[tj]s$/,    // Jest setup
   /test-utils\.[tj]sx?$/,   // Test utilities
killedBy: isTestRelatedPath allowed test paths should allow: jest.config.ts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
src/hooks/safety.ts:14:3
   /\.test\.[tj]sx?$/,       // Test files
   /\.spec\.[tj]sx?$/,       // Spec files
   /jest\.config\.[tj]s$/,   // Jest config
-  /jest\.setup\.[tj]s$/,    // Jest setup
+  /jest\.setup\.[tj]s/,    // Jest setup
   /test-utils\.[tj]sx?$/,   // Test utilities
   /\/test\/.*$/,             // Generic test directory

[Survived] Regex
src/hooks/safety.ts:15:3
   /\.spec\.[tj]sx?$/,       // Spec files
   /jest\.config\.[tj]s$/,   // Jest config
   /jest\.setup\.[tj]s$/,    // Jest setup
-  /test-utils\.[tj]sx?$/,   // Test utilities
+  /test-utils\.[tj]sx?/,   // Test utilities
   /\/test\/.*$/,             // Generic test directory
   /\/tests\/.*$/,            // Generic tests directory

[Survived] Regex
src/hooks/safety.ts:16:3
   /jest\.config\.[tj]s$/,   // Jest config
   /jest\.setup\.[tj]s$/,    // Jest setup
   /test-utils\.[tj]sx?$/,   // Test utilities
-  /\/test\/.*$/,             // Generic test directory
+  /\/test\/.*/,             // Generic test directory
   /\/tests\/.*$/,            // Generic tests directory
 ];

[Killed] BooleanLiteral
src/hooks/safety.ts:27:62
 ];
 
 export function isTestRelatedPath(filePath: string): boolean {
-  if (BLOCKED_PATTERNS.some((p) => p.test(filePath))) return false;
+  if (BLOCKED_PATTERNS.some((p) => p.test(filePath))) return true;
   if (ALLOWED_PATTERNS.some((p) => p.test(filePath))) return true;
   return false;
killedBy: isTestRelatedPath always-blocked patterns should block .env files even in test directories
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/hooks/safety.ts:27:7
 ];
 
 export function isTestRelatedPath(filePath: string): boolean {
-  if (BLOCKED_PATTERNS.some((p) => p.test(filePath))) return false;
+  if (false) return false;
   if (ALLOWED_PATTERNS.some((p) => p.test(filePath))) return true;
   return false;
killedBy: isTestRelatedPath always-blocked patterns should block .env files even in test directories
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/hooks/safety.ts:28:7
 
 export function isTestRelatedPath(filePath: string): boolean {
   if (BLOCKED_PATTERNS.some((p) => p.test(filePath))) return false;
-  if (ALLOWED_PATTERNS.some((p) => p.test(filePath))) return true;
+  if (ALLOWED_PATTERNS.every(p => p.test(filePath))) return true;
   return false;
 }
killedBy: isTestRelatedPath allowed test paths should allow: src/lib/__tests__/bm25.test.ts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/hooks/safety.ts:28:7
 
 export function isTestRelatedPath(filePath: string): boolean {
   if (BLOCKED_PATTERNS.some((p) => p.test(filePath))) return false;
-  if (ALLOWED_PATTERNS.some((p) => p.test(filePath))) return true;
+  if (false) return true;
   return false;
 }
killedBy: isTestRelatedPath allowed test paths should allow: src/lib/__tests__/bm25.test.ts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/hooks/safety.ts:29:10
 export function isTestRelatedPath(filePath: string): boolean {
   if (BLOCKED_PATTERNS.some((p) => p.test(filePath))) return false;
   if (ALLOWED_PATTERNS.some((p) => p.test(filePath))) return true;
-  return false;
+  return true;
 }
 
killedBy: isTestRelatedPath blocked source paths should block: src/lib/search/bm25.ts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/hooks/safety.ts:38:54
     const toolInput = input.tool_input as Record<string, unknown>;
 
     // Only intercept file-writing tools
-    if (toolName !== "Write" && toolName !== "Edit") {
-      return { decision: "approve" };
-    }
+    if (toolName !== "Write" && toolName !== "Edit") {}
 
     // Extract file path from tool input
killedBy: createSafetyHook non-write tools are always approved should approve Read tool
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "approve"
Received: "block"

[Killed] EqualityOperator
src/hooks/safety.ts:38:33
     const toolInput = input.tool_input as Record<string, unknown>;
 
     // Only intercept file-writing tools
-    if (toolName !== "Write" && toolName !== "Edit") {
+    if (toolName !== "Write" && toolName === "Edit") {
       return { decision: "approve" };
     }
killedBy: createSafetyHook non-write tools are always approved should approve Read tool
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "approve"
Received: "block"

[Killed] ObjectLiteral
src/hooks/safety.ts:39:14
 
     // Only intercept file-writing tools
     if (toolName !== "Write" && toolName !== "Edit") {
-      return { decision: "approve" };
+      return {};
     }
 
killedBy: createSafetyHook non-write tools are always approved should approve Read tool
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "approve"
Received: undefined

[Killed] ConditionalExpression
src/hooks/safety.ts:44:7
 
     // Extract file path from tool input
     const filePath =
-      (toolInput.file_path as string) || (toolInput.path as string) || "";
+      false || "";
 
     // Only enforce for files inside the target project
killedBy: createSafetyHook source files in target project are blocked should block Write to a source file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: "approve"

[Killed] LogicalOperator
src/hooks/safety.ts:44:7
 
     // Extract file path from tool input
     const filePath =
-      (toolInput.file_path as string) || (toolInput.path as string) || "";
+      (toolInput.file_path as string || toolInput.path as string) && "";
 
     // Only enforce for files inside the target project
killedBy: createSafetyHook source files in target project are blocked should block Write to a source file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: "approve"

[Killed] ConditionalExpression
src/hooks/safety.ts:47:9
       (toolInput.file_path as string) || (toolInput.path as string) || "";
 
     // Only enforce for files inside the target project
-    if (!filePath.startsWith(targetProjectPath)) {
+    if (true) {
       return { decision: "approve" };
     }
killedBy: createSafetyHook source files in target project are blocked should block Write to a source file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: "approve"

[Killed] ConditionalExpression
src/hooks/safety.ts:47:9
       (toolInput.file_path as string) || (toolInput.path as string) || "";
 
     // Only enforce for files inside the target project
-    if (!filePath.startsWith(targetProjectPath)) {
+    if (false) {
       return { decision: "approve" };
     }
killedBy: createSafetyHook files outside target project are always approved should approve Write to a file outside target
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "approve"
Received: "block"

[Killed] ConditionalExpression
src/hooks/safety.ts:52:9
     }
 
     // Check if the file is test-related
-    if (isTestRelatedPath(filePath)) {
+    if (true) {
       return { decision: "approve" };
     }
killedBy: createSafetyHook source files in target project are blocked should block Write to a source file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: "approve"

[Killed] ConditionalExpression
src/hooks/safety.ts:52:9
     }
 
     // Check if the file is test-related
-    if (isTestRelatedPath(filePath)) {
+    if (false) {
       return { decision: "approve" };
     }
killedBy: createSafetyHook test files in target project are approved should approve Write to a test file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "approve"
Received: "block"

[Survived] StringLiteral
src/hooks/safety.ts:57:20
     }
 
     // Block: not a test-related file
-    const reason = `BLOCKED: Cannot modify source file "${filePath}". Only test files (__tests__/*.test.ts(x)) are allowed.`;
+    const reason = ``;
     console.warn(`  [Safety Hook] ${reason}`);
     return {

[Killed] ObjectLiteral
src/hooks/safety.ts:59:12
     // Block: not a test-related file
     const reason = `BLOCKED: Cannot modify source file "${filePath}". Only test files (__tests__/*.test.ts(x)) are allowed.`;
     console.warn(`  [Safety Hook] ${reason}`);
-    return {
-      decision: "block",
-      reason,
-      hookSpecificOutput: {
-        hookEventName: "PreToolUse",
-        permissionDecision: "deny",
-        permissionDecisionReason: reason,
-      },
-    };
+    return {};
   };
 }
killedBy: createSafetyHook source files in target project are blocked should block Write to a source file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "block"
Received: undefined
