[Killed] ConditionalExpression
src/tools/coverage-parser.ts:48:56
 
 export function parseCoverageSummary(data: CoverageSummary): ParsedCoverage {
   const total = data["total"];
-  const files = Object.entries(data).filter(([key]) => key !== "total");
+  const files = Object.entries(data).filter(([key]) => true);
 
   const coveredFiles: ParsedCoverage["coveredFiles"] = [];
killedBy: parseCoverageSummary should return zero fileCount when only total exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/tools/coverage-parser.ts:48:56
 
 export function parseCoverageSummary(data: CoverageSummary): ParsedCoverage {
   const total = data["total"];
-  const files = Object.entries(data).filter(([key]) => key !== "total");
+  const files = Object.entries(data).filter(([key]) => key === "total");
 
   const coveredFiles: ParsedCoverage["coveredFiles"] = [];
killedBy: parseCoverageSummary should return zero fileCount when only total exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/tools/coverage-parser.ts:53:44
   const coveredFiles: ParsedCoverage["coveredFiles"] = [];
   const uncoveredFiles: ParsedCoverage["uncoveredFiles"] = [];
 
-  for (const [filePath, metrics] of files) {
-    const entry = {
-      file: filePath,
-      lines: metrics.lines.pct,
-      branches: metrics.branches.pct,
-      functions: metrics.functions.pct,
-      statements: metrics.statements.pct,
-    };
-
-    if (metrics.lines.pct === 0 && metrics.functions.pct === 0) {
-      uncoveredFiles.push(entry);
-    } else {
-      coveredFiles.push(entry);
-    }
-  }
+  for (const [filePath, metrics] of files) {}
 
   // Sort: uncovered by file name, covered by lines descending
killedBy: parseCoverageSummary should classify fully uncovered files (lines=0 AND functions=0)
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/tools/coverage-parser.ts:62:65
       statements: metrics.statements.pct,
     };
 
-    if (metrics.lines.pct === 0 && metrics.functions.pct === 0) {
-      uncoveredFiles.push(entry);
-    } else {
+    if (metrics.lines.pct === 0 && metrics.functions.pct === 0) {} else {
       coveredFiles.push(entry);
     }
killedBy: parseCoverageSummary should classify fully uncovered files (lines=0 AND functions=0)
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/tools/coverage-parser.ts:62:9
       statements: metrics.statements.pct,
     };
 
-    if (metrics.lines.pct === 0 && metrics.functions.pct === 0) {
+    if (metrics.lines.pct !== 0 && metrics.functions.pct === 0) {
       uncoveredFiles.push(entry);
     } else {
killedBy: parseCoverageSummary should classify fully uncovered files (lines=0 AND functions=0)
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/tools/coverage-parser.ts:64:12
 
     if (metrics.lines.pct === 0 && metrics.functions.pct === 0) {
       uncoveredFiles.push(entry);
-    } else {
-      coveredFiles.push(entry);
-    }
+    } else {}
   }
 
killedBy: parseCoverageSummary should classify files with any coverage as covered
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] MethodExpression
src/tools/coverage-parser.ts:70:3
   }
 
   // Sort: uncovered by file name, covered by lines descending
-  uncoveredFiles.sort((a, b) => a.file.localeCompare(b.file));
+  uncoveredFiles;
   coveredFiles.sort((a, b) => b.lines - a.lines);
 
killedBy: parseCoverageSummary should sort uncovered files alphabetically by file path
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "/src/z-module.ts",
    "/src/a-module.ts",

[Killed] MethodExpression
src/tools/coverage-parser.ts:71:3
 
   // Sort: uncovered by file name, covered by lines descending
   uncoveredFiles.sort((a, b) => a.file.localeCompare(b.file));
-  coveredFiles.sort((a, b) => b.lines - a.lines);
+  coveredFiles;
 
   return {
killedBy: parseCoverageSummary should sort covered files by lines coverage descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "/src/low.ts",
    "/src/high.ts",

[Killed] ArithmeticOperator
src/tools/coverage-parser.ts:71:31
 
   // Sort: uncovered by file name, covered by lines descending
   uncoveredFiles.sort((a, b) => a.file.localeCompare(b.file));
-  coveredFiles.sort((a, b) => b.lines - a.lines);
+  coveredFiles.sort((a, b) => b.lines + a.lines);
 
   return {
killedBy: parseCoverageSummary should sort covered files by lines coverage descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "/src/low.ts",
    "/src/high.ts",

[NoCoverage] BlockStatement
src/tools/coverage-parser.ts:97:37
       ),
   },
   async ({ coverage_path }) => {
-    if (!existsSync(coverage_path)) {
-      return {
-        content: [
-          {
-            type: "text" as const,
-            text: JSON.stringify(
-              { error: `File not found: ${coverage_path}` },
-              null,
-              2
-            ),
-          },
-        ],
-        isError: true,
-      };
-    }
+    if (!existsSync(coverage_path)) {}
 
     try {

[NoCoverage] BooleanLiteral
src/tools/coverage-parser.ts:97:9
       ),
   },
   async ({ coverage_path }) => {
-    if (!existsSync(coverage_path)) {
+    if (existsSync(coverage_path)) {
       return {
         content: [

[NoCoverage] ObjectLiteral
src/tools/coverage-parser.ts:103:15
           {
             type: "text" as const,
             text: JSON.stringify(
-              { error: `File not found: ${coverage_path}` },
+              {},
               null,
               2

[NoCoverage] StringLiteral
src/tools/coverage-parser.ts:103:24
           {
             type: "text" as const,
             text: JSON.stringify(
-              { error: `File not found: ${coverage_path}` },
+              { error: `` },
               null,
               2

[NoCoverage] BlockStatement
src/tools/coverage-parser.ts:113:9
       };
     }
 
-    try {
-      const raw = await readFile(coverage_path, "utf-8");
-      const data: CoverageSummary = JSON.parse(raw);
-      const result = parseCoverageSummary(data);
-
-      return {
-        content: [
-          {
-            type: "text" as const,
-            text: JSON.stringify(result, null, 2),
-          },
-        ],
-      };
-    } catch (err) {
+    try {} catch (err) {
       return {
         content: [

[NoCoverage] BlockStatement
src/tools/coverage-parser.ts:126:19
           },
         ],
       };
-    } catch (err) {
-      return {
-        content: [
-          {
-            type: "text" as const,
-            text: JSON.stringify(
-              { error: `Failed to parse coverage: ${String(err)}` },
-              null,
-              2
-            ),
-          },
-        ],
-        isError: true,
-      };
-    }
+    } catch (err) {}
   }
 );

[NoCoverage] ObjectLiteral
src/tools/coverage-parser.ts:132:15
           {
             type: "text" as const,
             text: JSON.stringify(
-              { error: `Failed to parse coverage: ${String(err)}` },
+              {},
               null,
               2

[NoCoverage] StringLiteral
src/tools/coverage-parser.ts:132:24
           {
             type: "text" as const,
             text: JSON.stringify(
-              { error: `Failed to parse coverage: ${String(err)}` },
+              { error: `` },
               null,
               2

[Survived] StringLiteral
src/tools/coverage-parser.ts:145:9
 );
 
 export const coverageServer = createSdkMcpServer({
-  name: "coverage-parser",
+  name: "",
   version: "1.0.0",
   tools: [parseCoverageTool],
